In [1]:
import pandas as pd

In [2]:
 data = {
     'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
     'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
              'Manchester', 'Cairo', 'Osaka'],
    'age': [41, 28, 33, 34, 38, 31, 37],
    'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
 }

row_labels = [101, 102, 103, 104, 105, 106, 107]

In [3]:
df = pd.DataFrame(data=data, index=row_labels)
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

Quand on boucle sur un dataframe, on boucle sur les noms des colonnes :

In [4]:
for x in df:
  print(x) # imprime le nom de la colonne

name
city
age
py-score

On peut boucler sur les lignes d'un dataframe, chaque ligne se comportant comme un namedtuple :

In [5]:
for x in df.itertuples():
  print(x.name) # Imprime la valeur courante de la colonne name de df

Xavier
Ann
Jana
Yi
Robin
Amal
Nori

Accès à une colonne :

df['city'] : renvoie la Series correspondant à la colonne de label city :

In [6]:
df['city']

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [7]:
df.loc[:, 'city'] #renvoie une series

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [8]:
df.loc[:, ['name']] #renvoie un dataframe.

       name
101  Xavier
102     Ann
103    Jana
104      Yi
105   Robin
106    Amal
107    Nori

In [9]:
df.iloc[3, :] #renvoie une series.

name              Yi
city        Shanghai
age               34
py-score        80.0
Name: 104, dtype: object

In [10]:
df['city'][0:3] #les 3 premières valeurs des 3 premières lignes de la colonne 'city' (sous forme de Series).

101    Mexico City
102        Toronto
103         Prague
Name: city, dtype: object

Accès à un sous-ensemble du dataframe avec les noms des lignes et colonnes :

In [11]:
df.loc[102] # renvoie la Series correspondant à la ligne d'index 102 :

name            Ann
city        Toronto
age              28
py-score       79.0
Name: 102, dtype: object

In [12]:
df.loc[[102, 104], ['name', 'city']]  # renvoie un dataframe avec un sous-ensemble des lignes et des colonnes :

    name      city
102  Ann   Toronto
104   Yi  Shanghai

In [13]:
df.loc[:,['name', 'py-score']] # toutes les lignes et seulement les colonnes name et py_score.

       name  py-score
101  Xavier      88.0
102     Ann      79.0
103    Jana      81.0
104      Yi      80.0
105   Robin      68.0
106    Amal      61.0
107    Nori      84.0

In [14]:
df.loc[102, 'name'] # accès à la valeur de la ligne 102 et de la colonne name

'Ann'

In [ ]:
df.at[107, 'city'] # autre façon recommandée d'accéder à la valeur de la ligne 107 et de la colonne City